zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/MCXW727D/gcc/startup_MCXW727D_cm33_core1.S
    ldr    r1, =__etext
    ldr    r2, =__data_start__
    ldr    r3, =__data_end__

#ifdef __PERFORMANCE_IMPLEMENTATION
/* Here are two copies of loop implementations. First one favors performance
 * and the second one favors code size. Default uses the second one.
 * Define macro "__PERFORMANCE_IMPLEMENTATION" in project to use the first one */
    subs    r3, r2
    ble    .LC1
.LC0:
    subs    r3, #4
    ldr    r0, [r1, r3]
    str    r0, [r2, r3]
    bgt    .LC0
.LC1:
#else  /* code size implemenation */
.LC0:
    cmp     r2, r3
    ittt    lt
    ldrlt   r0, [r1], #4
    strlt   r0, [r2], #4
    blt    .LC0
#endif

#ifdef __STARTUP_CLEAR_BSS
/*     This part of work usually is done in C library startup code. Otherwise,
 *     define this macro to enable it in this startup.
 *
 *     Loop to zero out BSS section, which uses following symbols
 *     in linker script:
 *      __bss_start__: start of BSS section. Must align to 4
 *      __bss_end__: end of BSS section. Must align to 4
 */
    ldr r1, =__bss_start__
    ldr r2, =__bss_end__

    movs    r0, 0
.LC2:
    cmp     r1, r2
    itt    lt
    strlt   r0, [r1], #4
    blt    .LC2
#endif /* __STARTUP_CLEAR_BSS */

    cpsie   i               /* Unmask interrupts */
#ifndef __START
#define __START _start
#endif
#ifndef __ATOLLIC__
    ldr   r0,=__START
    blx   r0
#else
    ldr   r0,=__libc_init_array
    blx   r0
    ldr   r0,=main
    bx    r0
#endif
    .pool
    .size Reset_Handler, . - Reset_Handler

    .align  1
    .thumb_func
    .weak DefaultISR
    .type DefaultISR, %function
DefaultISR:
    b DefaultISR
    .size DefaultISR, . - DefaultISR

    .align 1
    .thumb_func
    .weak NMI_Handler
    .type NMI_Handler, %function
NMI_Handler:
    ldr   r0,=NMI_Handler
    bx    r0
    .size NMI_Handler, . - NMI_Handler

    .align 1
    .thumb_func
    .weak HardFault_Handler
    .type HardFault_Handler, %function
HardFault_Handler:
    ldr   r0,=HardFault_Handler
    bx    r0
    .size HardFault_Handler, . - HardFault_Handler

    .align 1
    .thumb_func
    .weak SVC_Handler
    .type SVC_Handler, %function
SVC_Handler:
    ldr   r0,=SVC_Handler
    bx    r0
    .size SVC_Handler, . - SVC_Handler

    .align 1
    .thumb_func
    .weak PendSV_Handler
    .type PendSV_Handler, %function
PendSV_Handler:
    ldr   r0,=PendSV_Handler
    bx    r0
    .size PendSV_Handler, . - PendSV_Handler

    .align 1
    .thumb_func
    .weak SysTick_Handler
    .type SysTick_Handler, %function
SysTick_Handler:
    ldr   r0,=SysTick_Handler
    bx    r0
    .size SysTick_Handler, . - SysTick_Handler

    .align 1
    .thumb_func
    .weak RF_SFA_IRQHandler
    .type RF_SFA_IRQHandler, %function
RF_SFA_IRQHandler:
    ldr   r0,=RF_SFA_DriverIRQHandler
    bx    r0
    .size RF_SFA_IRQHandler, . - RF_SFA_IRQHandler


/*    Macro to define default handlers. Default handler
 *    will be weak symbol and just dead loops. They can be
 *    overwritten by other handlers */
    .macro def_irq_handler  handler_name
    .weak \handler_name
    .set  \handler_name, DefaultISR
    .endm

/* Exception Handlers */
    def_irq_handler    MemManage_Handler
    def_irq_handler    BusFault_Handler
    def_irq_handler    UsageFault_Handler
    def_irq_handler    SecureFault_Handler
    def_irq_handler    DebugMon_Handler
    def_irq_handler    BLE_INT0_IRQHandler
    def_irq_handler    BLE_INT1_IRQHandler
    def_irq_handler    BLE_INT2_IRQHandler
    def_irq_handler    BTU_FIQ_IRQHandler
    def_irq_handler    BTU_INT_IRQHandler
    def_irq_handler    BRF_INT_IRQHandler
    def_irq_handler    CTI_IRQ0_IRQHandler
    def_irq_handler    T1_INT_IRQHandler
    def_irq_handler    T2_INT_IRQHandler
    def_irq_handler    T3_INT_IRQHandler
    def_irq_handler    T4_INT_IRQHandler
    def_irq_handler    WDG2_INT_IRQHandler
    def_irq_handler    SI_INT_IRQHandler
    def_irq_handler    CTI_IRQ1_IRQHandler
    def_irq_handler    CPU2_MSG_RDY_INT_IRQHandler
    def_irq_handler    CPU2_MSG_SPC_AVAIL_INT_IRQHandler
    def_irq_handler    ZIGBEE_INT_IRQHandler
    def_irq_handler    CIU2_INT_IRQHandler
    def_irq_handler    CPU2_ERR_INT_IRQHandler
    def_irq_handler    GENLL_INT_IRQHandler
    def_irq_handler    BRIC_INT_IRQHandler
    def_irq_handler    RF_SFA_DriverIRQHandler
    def_irq_handler    RBME_INT_IRQHandler
    def_irq_handler    LCL_INT_IRQHandler
    def_irq_handler    RSM_INT_IRQHandler
    def_irq_handler    XO_RDY_INT_IRQHandler
    def_irq_handler    PLL_ABORT_INT_IRQHandler
    def_irq_handler    FMU_INT_IRQHandler
    def_irq_handler    WOR_INT_IRQHandler
    def_irq_handler    TPM2_INT_IRQHandler
    def_irq_handler    DSB_IRQHandler
    def_irq_handler    SECSUBSYS_IRQHandler
    def_irq_handler    LPTMR2_IRQHandler

    .end
